#1.Найдите сумму цифр трехзначного числа.
a = int(input())
s = (a // 100)
d = (a // 10) % 10
f = a % 10
print(s + f + d)
